{
  "model_type": "StagingLlama",
  "architectures": ["StagingLlamaForCausalLM"],
  "auto_map": {
    "AutoConfig": "configuration_staging_llama.StagingLlamaConfig",
    "AutoModelForCausalLM": "modeling_staging_llama.StagingLlamaForCausalLM"
  },
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 128000,
  "eos_token_id": 128009,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 256,
  "initializer_range": 0.02,
  "intermediate_size": 704,
  "max_position_embeddings": 4096,
  "mlp_bias": false,
  "num_attention_heads": 2,
  "num_hidden_layers": 24,
  "num_key_value_heads": 1,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-30,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "use_cache": true,
  "vocab_size": 128256,
  "qk_norm": true,
  "norm_everywhere": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.57.3"
}
