{
  "model_type": "StagingMoEllama",
  "architectures": ["StagingMoEllamaForCausalLM"],
  "auto_map": {
    "AutoConfig": "configuration_staging_MoEllama.StagingMoEllamaConfig",
    "AutoModelForCausalLM": "modeling_staging_MoEllama.StagingMoEllamaForCausalLM"
  },
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 128000,
  "eos_token_id": 128009,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 512,
  "intermediate_size": 1344,
  "moe_intermediate_size": 128,
  "n_shared_experts": 1,
  "n_active_experts": 8,
  "n_total_experts": 64,
  "moe_scaling_factor": 2.8232,
  "n_dense_layers": 1,
  "max_position_embeddings": 4096,
  "mlp_bias": false,
  "num_attention_heads": 4,
  "num_hidden_layers": 24,
  "num_key_value_heads": 2,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-30,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "use_cache": true,
  "vocab_size": 128256,
  "qk_norm": true,
  "norm_everywhere": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.57.3"
}
